# Kilojoules Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Kilojoules Property
UnitTypeId Class See Also
---
Kilojoules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Kilojoules { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Kilojoules As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Kilojoules {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace